'''
    함수(function) 선언
    def 함수명(매개변수, 매개변수2, ..., 매개변수ㅜN)

변수
    매개변수 : 값을 저장하는 변수
    참조변수 : 주소 저장하는 변수
    매개변수 : 함수 코드에 전달되는 Data 지정 변수

'''

# -----------------------------------------------------------------------------------
# 종류(Function)
# - 특정 기능을 구현하기 위한 코드 묶음을 의미
# - 자주 사용되는 기능을 함수로 구현함
# - 함수 생성 문법
#   def 함수이름()
#   def 함수이름(매개변수1, 매개변수,2 ...,매개변수):
#          실행코드
#          실행코드
#          return 리턴값     # 반환값, 결과값
# -----------------------------------------------------------------------------------
# 함수 기능 : 2개의 숫자의 합계를 계산 후 결과를 반환해주는 기능
# 함수 이름 : addTwo
# 매개 변수 : x, y
# 반환값 : 합계
# -----------------------------------------------------------------------------------
def addtwo(x,y):
    value=x+y
    return value


# -----------------------------------------------------------------------------------
# 함수 기능 : 2개의 숫자의 곱셈 계산 후 결과를 반환해주는 기능
# 함수 이름 : multi
# 매개 변수 : x, y
# 반환값 : 합계
# -----------------------------------------------------------------------------------

def multi(x,y):
    value = x*y
    return value

# -----------------------------------------------------------------------------------
# 함수 사용 => 함수 호출 (Calling)
# - 방법 : 함수이름(데이터, 데이터...)
# -----------------------------------------------------------------------------------
print(addtwo(2,3))
addtwo(5,2)
addtwo(-7,-4)


